#include <stdio.h>
#include <stdint.h>

int main() {
    // 3.1415926
    // 31415926 * 10^(-7)
    //
    // 1.0010101
    // 10010101 * 2^(-7)
    //
    // (1).0010101
    // (1)0010101 * 2^(-7)
    // 10101 * 2^(-7) + 1
    //
    // 1 / 0
    // +inf ; -inf
    // (q)nan (s)nan
    // normalized ~ very small
    // 
    // 1. классификация
    //

    // char msg[128] = "hello";

    // def: кодировка
    // кодировка - соответствие символа в набор байтиков

    // ascii
    // 0..255 (aka 1 byte; aka 0x00 до 0xff)

    for (int i = 0; i < 256; ++i) {
        printf("%c", (char)i);
    }


    0xfffe --> 0xff 0xfe
               0xfe 0xff

    0x0041 --> 0x00 0x41
               0x41 0x00

    /*
     * 1 символ - 1 байт
     * 1 символ - 2 байта
     *
     *
     *
     * буква закончилась
     * читаем следующую букву
     * 1. читаем 1 байт
     *  ? - 0 ИЛИ 1
     *  0b0??????? - буква из 1 байта (уже прочитанного)
     *  0b110????? - буква из 2 байт (надо read one more)
     *  0b1110???? - буква из 3 байт (2 more to read)
     *  0b11110??? - буква из 4 байт
     *
     *  UTF-8 = 
     *      ASCII
     *      + СИМВОЛЫ ИЗ 2-х байт
     *      + СИМВОЛЫ ИЗ 3-х байт
     *      + СИМВОЛЫ ИЗ 4-х байт
     *
     *
     *  если два байта
     *  0b110????? 0b10??????
     *      bukva_ptr = 0b110????? & 0b00011111 = 0b?????
     *
     *
     *
     */

    return 0;
}

